# Sheet

In [1]:
print("some text for the report!")

some text for the report!

In [2]:
CREATE TABLE Airlines(
    Airline_ID INT PRIMARY KEY     NOT NULL,
    Airline_Name           TEXT    NOT NULL,
    Country        CHAR(50),
    IATA            CHAR(3),
    ICAO           CHAR(4)
);

No result set received

In [3]:
INSERT INTO Airlines(Airline_ID, Airline_Name, Country, IATA, ICAO) 
VALUES (1, 'Test Airlines', 'United States', 'TAL', 'TEST');

IntegrityError: IntegrityError: UNIQUE constraint failed: Airlines.Airline_ID

In [4]:
SELECT * FROM Airlines

In [4]:
import pandas as pd
df = pd.DataFrame({'A': [111, 222], 'B': [333, 444]})

In [7]:
select * from df

,A,B
0,111,333
1,222,444

In [0]:
INSERT INTO Students (ID, NAME, AGE, ADDRESS, MARKS)
VALUES (1, 'John', 20, '21 Jump Street', 85),
       (2, 'Jane', 22, '31 Baker Street', 90),
       (3, 'Dave', 23, '41 Cherry Street', 95),
       (4, 'Emma', 21, '51 Pine Street', 88),
       (5, 'Tom', 20, '61 North Street', 91);

SQLError: SQLError: No sqlite filename is provided

In [0]:
INSERT INTO Students(ID, NAME, AGE, ADDRESS, MARKS)
VALUES (1, 'Student1', 20, 'Address1', 85),
       (2, 'Student2', 21, 'Address2', 90),
       (3, 'Student3', 22, 'Address3', 95),
       (4, 'Student4', 23, 'Address4', 100),
       (5, 'Student5', 24, 'Address5', 105);

SQLError: SQLError: No sqlite filename is provided

In [4]:
INSERT INTO Students(ID, NAME, AGE, ADDRESS, MARKS)
VALUES (1, 'Student1', 20, 'Address1', 85),
       (2, 'Student2', 21, 'Address2', 90),
       (3, 'Student3', 22, 'Address3', 95),
       (4, 'Student4', 23, 'Address4', 100),
       (5, 'Student5', 24, 'Address5', 105);

No result set received

In [7]:
SELECT * FROM Students

DatabaseError: DatabaseError: database disk image is malformed

# Sheet 2

In [1]:
import pandas as pd
import numpy.random as np

df = pd.DataFrame(np.rand(5, 1), columns=['This_is_a_very_long_column_name_1'])

In [3]:
select * from df

,This_is_a_very_long_column_name_1
0,0.638681
1,0.481886
2,0.325397
3,0.788463
4,0.684205